nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/shakesensor/mma8451.c
/************************************************************
 * Copyright (C), 2008-2012,
 * FileName:		// 文件名
 * Author:			// 作者
 * Date:			// 日期
 * Description:		// 模块描述
 * Version:			// 版本信息
 * Function List:	// 主要函数及其功能
 *     1. -------
 * History:			// 历史修改记录
 *     <author>  <time>   <version >   <desc>
 *     David    96/10/12     1.0     build this moudle
 ***********************************************************/
#include <stdio.h>
#include <rtthread.h>
#include <rtdevice.h>
#include <finsh.h>

#include "stm32f2xx.h"
#include "mma8451.h"
#include "math.h"
#include "App_moduleConfig.h"

/*
   软件模拟I2C 同MMA8451通讯

   SDA  PB3
   SCL  PB4
   INT1  PA14
   INT2  PA15
 */
#define TRUE	1
#define FALSE	0

#define MMA845X_ADDR 0x1d

#define I2C_Speed			100000
#define I2C1_SLAVE_ADDRESS7 0x42
#define I2C_PageSize		256

#define SCL_H		( GPIOB->BSRRL = GPIO_Pin_5 )
#define SCL_L		( GPIOB->BSRRH = GPIO_Pin_5 )
#define SCL_read	( GPIOB->IDR & GPIO_Pin_5 )

#define SDA_H		( GPIOB->BSRRL = GPIO_Pin_4 )
#define SDA_L		( GPIOB->BSRRH = GPIO_Pin_4 )
#define SDA_read	( GPIOB->IDR & GPIO_Pin_4 )

#define ERR_NONE	0x00
#define ERR_START1	0x01
#define ERR_START2	0x02
#define ERR_WAITACK 0x11

#define ERR_INITFAILED 0x80

#define STATUS_00_REG 0x00


/*
**  XYZ Data Registers
*/
#define OUT_X_MSB_REG	0x01
#define OUT_X_LSB_REG	0x02
#define OUT_Y_MSB_REG	0x03
#define OUT_Y_LSB_REG	0x04
#define OUT_Z_MSB_REG	0x05
#define OUT_Z_LSB_REG	0x06


/*
**  WHO_AM_I Device ID Register
*/
#define WHO_AM_I_REG	0x0D
#define MMA8451Q_ID		0x1A
#define MMA8452Q_ID		0x2A
#define MMA8453Q_ID		0x3A

#define F_SETUP_REG 0x09

#define TRIG_CFG_REG		0x0A
#define SYSMOD_REG			0x0B
#define INT_SOURCE_REG		0x0C
#define XYZ_DATA_CFG_REG	0x0E
//
//
#define HPF_OUT_MASK 0x10

#define FULL_SCALE_8G	0x02
#define FULL_SCALE_4G	0x01
#define FULL_SCALE_2G	0x00


/*
**  HP_FILTER_CUTOFF High Pass Filter Register
*/
#define HP_FILTER_CUTOFF_REG 0x0F

//
#define PULSE_HPF_BYP_MASK	0x20
#define PULSE_LPF_EN_MASK	0x10
#define SEL1_MASK			0x02
#define SEL0_MASK			0x01
#define SEL_MASK			0x03

#define PL_STATUS_REG	0x10
#define PL_CFG_REG		0x11
#define PL_COUNT_REG	0x12
#define PL_BF_ZCOMP_REG 0x13
#define PL_P_L_THS_REG	0x14
#define FF_MT_CFG_1_REG 0x15
#define FF_MT_CFG_2_REG 0x19

#define FF_MT_SRC_1_REG 0x16
#define FF_MT_SRC_2_REG 0x1A

#define FT_MT_THS_1_REG 0x17
#define FT_MT_THS_2_REG 0x1B

#define FF_MT_COUNT_1_REG	0x18
#define FF_MT_COUNT_2_REG	0x1C
#define TRANSIENT_CFG_REG	0x1D
#define TRANSIENT_SRC_REG	0x1E
#define TRANSIENT_THS_REG	0x1F

#define TRANSIENT_COUNT_REG 0x20
#define PULSE_CFG_REG		0x21
#define PULSE_SRC_REG		0x22
#define PULSE_THSX_REG		0x23
#define PULSE_THSY_REG		0x24
#define PULSE_THSZ_REG		0x25
#define PULSE_TMLT_REG		0x26
#define PULSE_LTCY_REG		0x27
#define PULSE_WIND_REG		0x28
#define ASLP_COUNT_REG		0x29


/*
**  CTRL_REG1 System Control 1 Register
*/
#define CTRL_REG1 0x2A
//

//
#define ASLP_RATE1_MASK 0x80
#define ASLP_RATE0_MASK 0x40
#define DR2_MASK		0x20
#define DR1_MASK		0x10
#define DR0_MASK		0x08
#define LNOISE_MASK		0x04
#define FREAD_MASK		0x02
#define ACTIVE_MASK		0x01
#define ASLP_RATE_MASK	0xC0
#define DR_MASK			0x38
//
#define ASLP_RATE_20MS	0x00
#define ASLP_RATE_80MS	ASLP_RATE0_MASK
#define ASLP_RATE_160MS ASLP_RATE1_MASK
#define ASLP_RATE_640MS ASLP_RATE1_MASK + ASLP_RATE0_MASK
//
#define DATA_RATE_1250US	0x00
#define DATA_RATE_2500US	DR0_MASK
#define DATA_RATE_5MS		DR1_MASK
#define DATA_RATE_10MS		DR1_MASK + DR0_MASK
#define DATA_RATE_20MS		DR2_MASK
#define DATA_RATE_80MS		DR2_MASK + DR0_MASK
#define DATA_RATE_160MS		DR2_MASK + DR1_MASK
#define DATA_RATE_640MS		DR2_MASK + DR1_MASK + DR0_MASK


/*
**  CTRL_REG2 System Control 2 Register
*/
#define CTRL_REG2 0x2B
//
//
#define ST_MASK		0x80
#define BOOT_MASK	0x40
#define SMODS1_MASK 0x20
#define SMODS0_MASK 0x10
#define SLPE_MASK	0x04
#define MODS1_MASK	0x02
#define MODS0_MASK	0x01
#define SMODS_MASK	0x18
#define MODS_MASK	0x03


/*
**  CTRL_REG3 Interrupt Control Register
*/
#define CTRL_REG3	0x2C
#define CTRL_REG4	0x2D
#define CTRL_REG5	0x2E
#define OFF_X_REG	0x2F
#define OFF_Y_REG	0x30
#define OFF_Z_REG	0x31


static struct rt_device dev_mma8451;

/*是否是首次运行，首次运行不上报状态*/
static uint8_t firstrun = 1;

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static void I2C_delay( void )
{
    //这里可以优化速度
    //缺省150
    __IO uint8_t i = 30;
    while( i )
    {
        i--;
    }
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static uint8_t I2C_Start( void )
{
    SDA_H;
    //	I2C_delay();
    SCL_H;
    I2C_delay( );
    if( !SDA_read )
    {
        return ERR_START1;  //SDA线为低电平则总线忙,退出
    }
    SDA_L;
    I2C_delay( );
    if( SDA_read )
    {
        return ERR_START2;  //SDA线为高电平则总线出错,退出
    }
    SDA_L;
    I2C_delay( );
    return ERR_NONE;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static void I2C_Stop( void )
{
    SCL_L;
    I2C_delay( );
    SDA_L;
    I2C_delay( );
    SCL_H;
    I2C_delay( );
    SDA_H;
    I2C_delay( );
}

/*
   I2C的Master 通知 Slave 停止发送
 */
static void I2C_NoAck( void )
{
    SCL_L;
    I2C_delay( );
    SDA_H;
    I2C_delay( );
    SCL_H;
    I2C_delay( );
    SCL_L;
    I2C_delay( );
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static uint8_t I2C_WaitAck( void )   //返回为:=1有ACK,=0无ACK
{
    SCL_L;
    I2C_delay( );
    SDA_H;
    I2C_delay( );
    SCL_H;
    I2C_delay( );
    if( SDA_read )
    {
        SCL_L;
        I2C_delay( );
        return ERR_WAITACK;
    }
    SCL_L;
    I2C_delay( );
    return ERR_NONE;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static void I2C_SendByte( u8 SendByte ) //数据从高位到低位//
{
    uint8_t i = 8;
    while( i-- )
    {
        SCL_L;
        I2C_delay( );
        if( SendByte & 0x80 )
        {
            SDA_H;
        }
        else
        {
            SDA_L;
        }
        SendByte <<= 1;
        I2C_delay( );
        SCL_H;
        I2C_delay( );
    }
    SCL_L;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static uint8_t I2C_ReceiveByte( void )  //数据从高位到低位//
{
    uint8_t i			= 8;
    uint8_t ReceiveByte = 0;

    SDA_H;
    while( i-- )
    {
        ReceiveByte <<= 1;
        SCL_L;
        I2C_delay( );
        SCL_H;
        I2C_delay( );
        if( SDA_read )
        {
            ReceiveByte |= 0x01;
        }
    }
    SCL_L;
    return ReceiveByte;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static uint8_t IIC_RegWrite( uint8_t address, uint8_t reg, uint8_t val )
{
    uint8_t err = ERR_NONE;
    err = I2C_Start( );
    if( err )
    {
        goto lbl_ERR_REG_WR;
    }
    I2C_SendByte( MMA845X_ADDR << 1 );
    err = I2C_WaitAck( );
    if( err )
    {
        goto lbl_ERR_REG_WR_STOP;
    }

