nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/shakesensor/mma8451.c
    I2C_SendByte( reg );
    err = I2C_WaitAck( );
    if( err )
    {
        goto lbl_ERR_REG_WR_STOP;
    }

    I2C_SendByte( val );
    err = I2C_WaitAck( );
    if( err )
    {
        goto lbl_ERR_REG_WR_STOP;
    }
    I2C_Stop( );
    //todo:这里需要延时5ms吗?
    return ERR_NONE;

lbl_ERR_REG_WR_STOP:
    I2C_Stop( );
lbl_ERR_REG_WR:
    //rt_kprintf( "reg_wr error=%02x reg=%02x value=%02x\r\n", err, reg, val );
    return err;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static uint8_t IIC_RegRead( uint8_t address, uint8_t reg, uint8_t *value )
{
    uint8_t err = ERR_NONE;

    err = I2C_Start( );
    if( err )
    {
        goto lbl_ERR_REG_RD_STOP;
    }
    I2C_SendByte( address << 1 );
    err = I2C_WaitAck( );
    if( err )
    {
        goto lbl_ERR_REG_RD_STOP;
    }

    I2C_SendByte( reg );
    err = I2C_WaitAck( );
    if( err )
    {
        goto lbl_ERR_REG_RD_STOP;
    }

    err = I2C_Start( );
    if( err )
    {
        goto lbl_ERR_REG_RD;
    }

    I2C_SendByte( ( address << 1 ) | 0x01 );
    err = I2C_WaitAck( );
    if( err )
    {
        goto lbl_ERR_REG_RD_STOP;
    }

    *value = I2C_ReceiveByte( );
    I2C_NoAck( );
    I2C_Stop( );
    return ERR_NONE;

lbl_ERR_REG_RD_STOP:
    I2C_Stop( );
lbl_ERR_REG_RD:
    //rt_kprintf( "reg_rd error=%02x reg=%02x\r\n", err, reg );
    return err;
}
/*
   利用systick定时查询，打印中使用了systick的查询方式
 */

volatile uint32_t	ticks = 0;

uint32_t			lastsend_rotation_ticks = 0;
uint32_t			lastsend_crash_ticks	= 0;
uint8_t				last_plstatus			= 0;

uint16_t			last_g_value = 0;

uint16_t			param_mma8451_word1 = 0x8000;   //  使能状态
uint16_t			param_mma8451_word2 = 0xFFFF; //0x1E02; /* 振动 0x1e:单位4ms的倍数  0x02:碰撞加速度门限 0.1g的倍数*/

uint8_t				crash_counter = 0;

uint8_t				CTRL_REG1_value			= 0x10;
uint8_t				PL_BF_ZCOMP_REG_value	= 0xc7;
uint8_t				PL_P_L_THS_REG_vlaue	= 0xcf;

u32    shaker_continueCounter = 0; // 连续振动状态指示计数器

/*
读取
 */
void EXTI9_5_IRQHandler( void )
{
    uint8_t value1, value2, value3;
    if( EXTI_GetITStatus( EXTI_Line5 ) != RESET )
    {
        IIC_RegRead( MMA845X_ADDR, INT_SOURCE_REG, &value1 );
        IIC_RegRead( MMA845X_ADDR, PL_STATUS_REG, &value2 );
        IIC_RegRead( MMA845X_ADDR, PULSE_SRC_REG, &value3 );
        //rt_kprintf("\nINT=%02x %02x %02x\n",value1,value2,value3);
        //                                                          trigger  type    grade
        /*
                   Shake Trigger
        */
        //--------------Process  -----------
        if((Warn_Status[0] & 0x20) == 0x00) // 如果没报警那么就让他报警
        {
            shaker_continueCounter++;
            if(shaker_continueCounter > 2600)
            {
                shaker_continueCounter = 0;
                //----------------------------------------
                if(firstrun == 1)
                    firstrun = 0;    //上电 第一次触发不上报
                else
                {
                    Warn_Status[0] |= 0x20; //bit29
                    PositionSD_Enable();  // 使能发送
                    Current_UDP_sd = 1;
                    if(GB19056.workstate == 0)
                        rt_kprintf("\r\n  碰撞侧翻触发!\r\n");
                }
                //------------------------------------------
            }
        }
        // ---------------- Process ---------
        EXTI_ClearITPendingBit( EXTI_Line5 );
    }
    else
    {
        shaker_continueCounter = 0;
    }
}

/*
   使用外部中断触发 PD5
 */

void EXTILine5_Config( void )
{
    GPIO_InitTypeDef	GPIO_InitStructure;
    NVIC_InitTypeDef	NVIC_InitStructure;
    EXTI_InitTypeDef	EXTI_InitStructure;

    /* Enable GPIOD clock */
    RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOD, ENABLE );
    /* Enable SYSCFG clock */
    RCC_APB2PeriphClockCmd( RCC_APB2Periph_SYSCFG, ENABLE );

    /* Configure PD5 pin as input floating */
    GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_IN;
    GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_NOPULL;
    GPIO_InitStructure.GPIO_Pin		= GPIO_Pin_5;
    GPIO_Init( GPIOD, &GPIO_InitStructure );

    /* Connect EXTI Line5 to PD5 pin */
    SYSCFG_EXTILineConfig( EXTI_PortSourceGPIOD, EXTI_PinSource5 );

    /* Configure EXTI Line5 */
    EXTI_InitStructure.EXTI_Line	= EXTI_Line5;
    EXTI_InitStructure.EXTI_Mode	= EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init( &EXTI_InitStructure );

    /* Enable and set EXTI Line0 Interrupt to the lowest priority */
    NVIC_InitStructure.NVIC_IRQChannel						= EXTI9_5_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority	= 0x02;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority			= 0x01;
    NVIC_InitStructure.NVIC_IRQChannelCmd					= ENABLE;
    NVIC_Init( &NVIC_InitStructure );
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
uint8_t mma8451_config( uint16_t param1, uint16_t param2 )
{
    unsigned char res = 0;
    param_mma8451_word1 = param1;
    param_mma8451_word2 = param2;

    //standby
    if( IIC_RegWrite( MMA845X_ADDR, CTRL_REG1, ( CTRL_REG1_value & ~ACTIVE_MASK ) ) )
    {
        goto lbl_mma8451_config_err;
    }


    /*
       res = IIC_RegWrite( MMA845X_ADDR, CTRL_REG1, CTRL_REG1_value);
       if( res )
       {
       goto lbl_mma8451_config_err;
       }
     */
    if( IIC_RegWrite( MMA845X_ADDR, XYZ_DATA_CFG_REG, FULL_SCALE_4G ) )
    {
        goto lbl_mma8451_config_err;
    }


    /*Step 2: Set the data rate to 50 Hz (for example, but can choose any sample rate).
       CTRL_REG1_Data = IIC_RegRead(0x2A); //Note: Can combine this step with above
       CTRL_REG1_Data& = 0xC7; //Clear the sample rate bits
       CTRL_REG1_Data | = 0x20; //Set the sample rate bits to 50 Hz
       IC_RegWrite(0x2A, CTRL_REG1_Data); //Write updated value into the register.
     */


