nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/shakesensor/mma8451.c
    /*
       Step 10: Set the debounce counter in register 0x12
       This value will scale depending on the application-specific required ODR.
       If the device is set to go to sleep, reset the debounce counter before the device goes to sleep. This setting
       helps avoid long delays since the debounce will always scale with the current sample rate. The debounce
       can be set between 50 ms - 100 ms to avoid long delays.
       IIC_RegWrite(0x12, 0x05); //This sets the debounce counter to 100 ms at 50 Hz
     */

    res = IIC_RegWrite( MMA845X_ADDR, PL_COUNT_REG, 0x02 );
    if( res )
    {
        goto lbl_mma8451_config_err;
    }


    /*
       Step 11: Put the device in Active Mode
       CTRL_REG1_Data = IIC_RegRead(0x2A); //Read out the contents of the register
       CTRL_REG1_Data | = 0x01; //Change the value in the register to Active Mode.
       IIC_RegWrite(0x2A, CTRL_REG1_Data); //Write in the updated value to put the device in Active Mode
     */

    //	value=IIC_RegRead(MMA845X_ADDR,CTRL_REG1);
    //	value |= 0x01;
    //	IIC_RegWrite(MMA845X_ADDR,CTRL_REG1,value);
    //active

    /*TAP设置*/
    if( IIC_RegWrite( MMA845X_ADDR, PULSE_CFG_REG, 0x55 ) )
    {
        goto lbl_mma8451_config_err;
    }

    //加速度门限 0.1g 1-79	扩展为0.0625  1-127  扩大1.6倍
    /*
    	res = ( ( param_mma8451_word2 & 0xff00 ) >> 8 ) * 1.6;

    	if( IIC_RegWrite( MMA845X_ADDR, PULSE_THSX_REG, res ) )
    	{
    		goto lbl_mma8451_config_err;
    	}
    	if( IIC_RegWrite( MMA845X_ADDR, PULSE_THSY_REG, res ) )
    	{
    		goto lbl_mma8451_config_err;
    	}
    	if( IIC_RegWrite( MMA845X_ADDR, PULSE_THSZ_REG, res ) )
    	{
    		goto lbl_mma8451_config_err;
    	}

    	res = param_mma8451_word2 & 0xff;
    	if( IIC_RegWrite( MMA845X_ADDR, PULSE_TMLT_REG, res ) )
    	{
    		goto lbl_mma8451_config_err;
    	}
    */

    res = ( param_mma8451_word2 & 0xff) * 1.6;

    if( IIC_RegWrite( MMA845X_ADDR, PULSE_THSX_REG, res ) )
    {
        goto lbl_mma8451_config_err;
    }
    if( IIC_RegWrite( MMA845X_ADDR, PULSE_THSY_REG, res ) )
    {
        goto lbl_mma8451_config_err;
    }
    if( IIC_RegWrite( MMA845X_ADDR, PULSE_THSZ_REG, res ) )
    {
        goto lbl_mma8451_config_err;
    }

    res = (param_mma8451_word2 & 0xff00) >> 8;
    if( IIC_RegWrite( MMA845X_ADDR, PULSE_TMLT_REG, res ) )
    {
        goto lbl_mma8451_config_err;
    }



    if( IIC_RegWrite( MMA845X_ADDR, CTRL_REG1, ( CTRL_REG1_value | ACTIVE_MASK ) ) )
    {
        goto lbl_mma8451_config_err;
    }

    if( IIC_RegWrite( MMA845X_ADDR, CTRL_REG4, 0x10 ) )
    {
        goto lbl_mma8451_config_err;
    }


    return ERR_NONE;

lbl_mma8451_config_err:
    return res;
}

//FINSH_FUNCTION_EXPORT(mma8451_config ,setup sensor);




/*
   碰撞时间门限
   碰撞加速度门限

   指定时间门限内，加速度持续大于门限即为碰撞
 */

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
int mma8451_rx( unsigned char *pdata, unsigned int len )
{
    if( pdata[0] == 1 )
    {
        param_mma8451_word1 = ( pdata[1] << 8 ) | pdata[2];
        param_mma8451_word2 = ( pdata[3] << 8 ) | pdata[4];
        //		EE_WriteVariable( VirtAddVarTab[12], param_mma8451_word1 );
        //		EE_WriteVariable( VirtAddVarTab[13], param_mma8451_word2 );
        mma8451_config( param_mma8451_word1, param_mma8451_word2 );
    }
    return 0;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t mma8451_init( rt_device_t dev )
{
    GPIO_InitTypeDef	GPIO_InitStructure;
    //	uint16_t			res;
    //	uint16_t			param1	= 0x8000, param2 = 0x1e02;
    //	uint16_t			i		= 0;

    RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOB, ENABLE );
    /*去掉JTAG功能*/
    GPIO_PinAFConfig( GPIOB, GPIO_Pin_4, 1 );

    GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_2MHz;
    GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType	= GPIO_OType_OD;
    GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_UP;

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;   /*SCL*/
    GPIO_Init( GPIOB, &GPIO_InitStructure );

    GPIO_InitStructure.GPIO_OType	= GPIO_OType_OD;
    GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_UP;

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;   /*SDA*/
    GPIO_Init( GPIOB, &GPIO_InitStructure );
    SCL_H;
    SDA_H;
    mma8451_config( param_mma8451_word1, param_mma8451_word2 );
    EXTILine5_Config( );
    return RT_EOK;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_err_t mma8451_open( rt_device_t dev, rt_uint16_t oflag )
{
    return RT_EOK;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_size_t mma8451_read( rt_device_t dev, rt_off_t pos, void *buff, rt_size_t count )
{
    return RT_EOK;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_size_t mma8451_write( rt_device_t dev, rt_off_t pos, const void *buff, rt_size_t count )
{
    return RT_EOK;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_err_t mma8451_control( rt_device_t dev, rt_uint8_t cmd, void *arg )
{
    //	uint8_t code = *(uint8_t*)arg;
    //	int		i;
    switch( cmd )
    {
    }
    return RT_EOK;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_err_t mma8451_close( rt_device_t dev )
{
    return RT_EOK;
}

/*

   传感器处理线程
   原先为函数方式，现在采用线程，使用状态机
 */

#define MMA8451_CONFIG	1
#define MMA8451_TILT	2   /*倾斜检测*/
#define MMA8451_TAP		3   /*震动检测*/


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void mma8451_driver_init( void )
{
    dev_mma8451.type		= RT_Device_Class_Char;
    dev_mma8451.init		= mma8451_init;
    dev_mma8451.open		= mma8451_open;
    dev_mma8451.close		= mma8451_close;
    dev_mma8451.read		= mma8451_read;
    dev_mma8451.write		= mma8451_write;
    dev_mma8451.control		= mma8451_control;
    dev_mma8451.user_data	= RT_NULL;

    rt_device_register( &dev_mma8451, "sensor", RT_DEVICE_FLAG_RDWR );
    rt_device_init( &dev_mma8451 );
}







/************************************** The End Of File **************************************/
